[
    {
        "id": "personalized",
        "title": "Bespoke advice tailored to you",
        "body": "For over 100 years, we’ve built a reputation for outstanding service and trusted investment management advice, one client at a time. \nScotiaMcLeod is a full-service wealth management firm with a team of experienced investment management professionals and a bold, distinctive culture of professionalism and integrity.\nRemaining true to our founding guiding principles, we offer Canadian investors proactive, informed investment advice, creative financial solutions and innovative approaches to protecting and growing your assets. \nScotiaMcLeod Wealth Advisors are committed to understanding your financial vision and delivering personalized advice through our disciplined approach to investment management. We offer highly customized family wealth management services – developing, executing and monitoring an exclusive portfolio, designed to manage risk and achieve your wealth goals.\nLearn more about how a ScotiaMcLeod Wealth Advisor can help you develop and realize your financial vision."
    },
    {
        "id": "tailored",
        "title": "Wealth management solutions for your every need",
        "body": "ScotiaMcLeod takes a long-term, holistic view to investment management while managing risk. We’re dedicated to prioritizing your needs to help you reach your short-, medium- and long-term financial goals. \nWe start by meeting you, learning about your needs, financial goals, concerns, risk tolerance, tax situation, time horizon, liquidity, return objectives, and preferred level of participation. \nNo matter your preferred level of investment management, your Wealth Advisor works with you to assess your individual and family wealth needs, in order to tailor a personalized investment strategy to guide the management of your portfolio’s optimal asset allocation, investment mix and diversification.\n\nSecure access, anywhere\nIt’s here! The new Scotia Wealth Management mobile app, designed for ScotiaMcLeod® clients. Learn more"
    },
    {
        "id": "envisioning",
        "title": "An investment management service for every financial vision",
        "body": "Your Wealth Advisor will work with you to choose investment products and wealth management resources that best meet your needs, ambitions, lifestyle, time horizon and risk tolerance.\nDepending on your life stage and financial goals, we will explore the merits of a wide variety of investment accounts and options with you. These include equities, fixed income vehicles, Registered Retirement Savings Plans (RRSPs), Registered Retirement Income Funds (RRIFs), Individual Pension Plans (IPPs), Tax-Free Savings Accounts (TFSAs), Registered Education Savings Plans (RESPs), exchange-traded funds (ETFs) and mutual funds (MFs)."
    },
    {
        "id": "about us",
        "title": "How wealth management works at ScotiaMcLeod",
        "body": "Your Wealth Advisor will develop an integrated Total Wealth Plan that prioritizes your individual and family financial goal. We will work with you to determine the best solutions to achieve your objectives and manage your portfolio in alignment with your long-term wealth plan and goals. \nOnce implemented, we continually monitor the progress of your portfolio and adapt it as your life and goals evolve. \nWe’ll communicate regularly to help you make informed decisions about your financial well-being, inform you of market trends that may affect your investments, review your needs and goals and refine our wealth management strategy to reflect your changing situation. You'll also have access to Scotia online, available on desktop, mobile, tablet, and through the Scotia Wealth Management mobile app. Learn more about the features and benefits."
    }
]
